# Установка базового образа
FROM node:18

# Установка директории приложения в контейнере
WORKDIR /server

# Копирование зависимостей и package.json
COPY package.json /server/

# Установка зависимостей
RUN npm install
# Если вы хотите использовать Yarn, сначала убедитесь, что он установлен в вашем образе:
# RUN npm install -g yarn && yarn install

# Копирование файлов приложения в контейнер
COPY ./server /server

# Открытие порта, на котором будет работать приложение
EXPOSE 3000

# Команда запуска приложения
CMD ["npm", "run", "start:dev"]